/* 
 + 文件名  ：scheduler.c
 + 描述    ：任务调度
*/
#include "includes.h"

/* 循环计数结构体 */
loop_t loop;

/*----------------------------------------------------------
 + 实现功能：1ms周期任务
----------------------------------------------------------*/
void Duty_1ms()
{

}

/*----------------------------------------------------------
 + 实现功能：2ms周期任务
----------------------------------------------------------*/
void Duty_2ms()
{

}

/*----------------------------------------------------------
 + 实现功能：5ms周期任务
----------------------------------------------------------*/
void Duty_5ms()
{

}

/*----------------------------------------------------------
 + 实现功能：10ms周期任务
----------------------------------------------------------*/
void Duty_10ms()
{

}

/*----------------------------------------------------------
 + 实现功能：20ms周期任务
----------------------------------------------------------*/
void Duty_20ms()
{

}

/*----------------------------------------------------------
 + 实现功能：50ms周期任务
----------------------------------------------------------*/
void Duty_50ms()
{

}

/*----------------------------------------------------------
 + 实现功能：100ms周期任务
----------------------------------------------------------*/
void Duty_100ms()
{

}

/*----------------------------------------------------------
 + 实现功能：主循环 由主函数调用
----------------------------------------------------------*/
void Main_Loop()
{
    /* 循环周期为1ms */
    if( loop.check_flag == 1 )
    {
        Duty_1ms();     //周期1ms的任务
        /* 判断每个不同周期的执行任务执行条件 */
        if( loop.cnt_2ms >= 2 )
        {
            loop.cnt_2ms = 0;
            Duty_2ms();     //周期2ms的任务
        }
        if( loop.cnt_5ms >= 5 )
        {
            loop.cnt_5ms = 0;
            Duty_5ms();     //周期5ms的任务
        }
        if( loop.cnt_10ms >= 10 )
        {
            loop.cnt_10ms = 0;
            Duty_10ms();    //周期10ms的任务
        }
        if( loop.cnt_20ms >= 20 )
        {
            loop.cnt_20ms = 0;
            Duty_20ms();    //周期20ms的任务
        }
        if( loop.cnt_50ms >= 50 )
        {
            loop.cnt_50ms = 0;
            Duty_50ms();    //周期50ms的任务
        }
        if( loop.cnt_100ms >= 100 )
        {
            loop.cnt_100ms = 0;
            Duty_100ms();    //周期100ms的任务
        }
        /* 循环运行完毕 标志清零 */
        loop.check_flag = 0;
    }
}

/*----------------------------------------------------------
 + 实现功能：由Systick定时器调用 周期：1毫秒
----------------------------------------------------------*/
void Call_Loop_timer()
{
    /* 等待数传数据开始发送 */
    static short time_1ms;
	
    /* 不同周期的执行任务独立计时 */
    loop.cnt_2ms++;
    loop.cnt_5ms++;
    loop.cnt_10ms++;
    loop.cnt_20ms++;
    loop.cnt_50ms++;
    loop.cnt_100ms++;

    /* 如果代码在预定周期内没有运行完 */
    if( loop.check_flag == 1)
        /* 错误次数计数 */
        loop.err_flag ++;
    /* 循环运行开始 标志置1 */
    else loop.check_flag = 1;


    /* 上电延时 标志置1 */
    if(time_1ms == 4096)
    {
        time_1ms++;
    }
    else if(time_1ms < 4096)
        time_1ms++;
}

/* ©2015-2016 Beijing Bechade Opto-Electronic, Co.,Ltd. All rights reserved. */
